jsphuebner/stm32-car/src/stm32_car.cpp
/*
 * This file is part of the tumanako_vc project.
 *
 * Copyright (C) 2010 Johannes Huebner <contact@johanneshuebner.com>
 * Copyright (C) 2010 Edward Cheeseman <cheesemanedward@gmail.com>
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#include <stdint.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/stm32/timer.h>
#include <libopencm3/stm32/rtc.h>
#include <libopencm3/stm32/can.h>
#include <libopencm3/stm32/iwdg.h>
#include <libopencm3/stm32/crc.h>
#include <libopencm3/stm32/f1/bkp.h>
#include "stm32_can.h"
#include "canmap.h"
#include "cansdo.h"
#include "sdocommands.h"
#include "canobd2.h"
#include "terminal.h"
#include "params.h"
#include "hwdefs.h"
#include "digio.h"
#include "hwinit.h"
#include "anain.h"
#include "param_save.h"
#include "my_math.h"
#include "errormessage.h"
#include "printf.h"
#include "stm32scheduler.h"
#include "mebbms.h"
#include "chademo.h"
#include "isashunt.h"
#include "terminalcommands.h"

#define CAN_TIMEOUT       50  //500ms
#define PRINT_JSON 0

HWREV hwRev; //Hardware variant of board we are running on

static Stm32Scheduler* scheduler;
static CanHardware* can;
static CanMap* canMap;
MebBms* mebBms;
static IsaShunt* isa;
static int ignitionTimeout = 0;
static int chargerTimeout = 0;

static modes StateMachine(modes mode)
{
   static int startTime = 0;
   modes newMode = mode;
   int udcbms = Param::GetInt(Param::udcbms); // Total voltage from the Battery Management System (BMS)
   int udcobc = Param::GetInt(Param::udcobc); // On-Board Charger voltage
   bool chargePin = Param::GetBool(Param::din_charge); // State of the charging pin
   bool invRunning = Param::GetInt(Param::udcinv) > 10; // This indicates if the inverter is sending on the CAN bus
   bool invStarted = Param::GetInt(Param::invmode) == MOD_DRIVE; // Inverter has been started for driving
   bool prechargeComplete = udcbms > 250 && (udcbms - udcobc) < 10; // Precharge process completion check
   bool obcSocLimReached = Param::GetFloat(Param::soc) >= Param::GetFloat(Param::obcsoclimit); // SOC limit for On-Board Charging reached
   bool fcSocLimReached = Param::GetFloat(Param::soc) >= Param::GetFloat(Param::fcsoclimit); // SOC limit for Fast Charging reached
   bool keyStart = Param::GetBool(Param::din_start); // State of the key start
   bool stationary = Param::GetInt(Param::speed) == 0; // Vehicle stationary check

   if (chargerTimeout > 0)
      chargerTimeout--;

   switch (mode)
   {
   case MOD_OFF:
      //we can't rely on the charge pin alone because it doesn't go high when cold starting into charge mode
      if (chargePin || !invRunning)
      {
         //Give the CCS interface some time to start up and send messages
         if ((rtc_get_counter_val() - startTime) > 150)
         {
            if (chargerTimeout > 0) //if we get messages from the CCS interface we enter quick charge state
               newMode = MOD_QUICKSTART;
            else //otherwise we enter OBC state
               newMode = MOD_CHARGESTART;
         }
      }
      else if (invStarted && prechargeComplete)
         newMode = MOD_DRIVE;
      break;
   case MOD_CHARGESTART:
      if (!chargePin && keyStart && prechargeComplete)
         newMode = MOD_DRIVE;
      else if (obcSocLimReached)
         newMode = MOD_CHARGESTART; //stay here until a higher limit is configured
      else if (prechargeComplete)
         newMode = MOD_CHARGE;
      break;
   case MOD_CHARGE:
      if (obcSocLimReached)
         newMode = MOD_CHARGEND;
      else if (!chargePin && keyStart) //Contactor already closed, no precharge check
         newMode = MOD_DRIVE;
      break;
   case MOD_QUICKSTART:
      if (fcSocLimReached)
         newMode = MOD_CHARGEND;
      else if (ChaDeMo::ConnectorLocked())
         newMode = MOD_QUICKCHARGE;
      else if (!chargePin && keyStart && prechargeComplete)
         newMode = MOD_DRIVE;
      break;
   case MOD_QUICKCHARGE:
      if (fcSocLimReached)
         newMode = MOD_CHARGEND;
      else if (!chargePin && keyStart && prechargeComplete)
         newMode = MOD_DRIVE;
      break;
   case MOD_CHARGEND:
      if (!chargePin && keyStart && prechargeComplete)
         newMode = MOD_DRIVE;
      break;
   case MOD_DRIVE:
      if (stationary && chargePin)
         newMode = MOD_OFF;
      startTime = rtc_get_counter_val();
      break;
   default:
      newMode = MOD_OFF;
   }

   return newMode;
}

static void Ms500Task(void)
{
   static modes modeLast = MOD_OFF;
   static int blinks = 0;
   static int regenLevelLast = 0;
   static bool acqAhin = false;
   modes mode = (modes)Param::GetInt(Param::opmode);
   bool cruiseLight = Param::GetBool(Param::cruiselight);
   int regenLevel = Param::GetInt(Param::regenlevel);

   if (mode == MOD_DRIVE && modeLast == MOD_OFF)
   {
      blinks = 10;
   }
   if (blinks > 0)
   {
      blinks--;
      Param::SetInt(Param::cruiselight, !cruiseLight);
   }
   else if (Param::GetInt(Param::cruisespeed) > 0)
   {
      Param::SetInt(Param::cruiselight, 1);
   }
   else
   {
      Param::SetInt(Param::cruiselight, 0);
      //Signal regen level by number of blinks + 1
      if (mode == MOD_DRIVE && regenLevel != regenLevelLast)
      {

         blinks = 2 * (regenLevel + 1);
      }
   }

   if (acqAhin)
   {
      Param::SetFloat(Param::ahout, (float)isa->GetLogData() / 3600);
      isa->AcquireLogData(IsaShunt::AS_CHARGE);
   }
   else
   {
      Param::SetFloat(Param::ahin, (float)isa->GetLogData() / 3600);
      isa->AcquireLogData(IsaShunt::AS_DISCHARGE);
   }

   regenLevelLast = Param::GetInt(Param::regenlevel);
   modeLast = mode;
   acqAhin = !acqAhin;
}

