jsphuebner/stm32-car/src/stm32_car.cpp
static void ProcessCruiseControlButtons()
{
   static bool transition = false;
   static int cruiseTarget = 0;
   int cruisespeed = Param::GetInt(Param::cruisespeed);
   int cruisestt = Param::GetInt(Param::cruisestt);

   if (transition)
   {
      if ((cruisestt & (CRUISE_SETP | CRUISE_SETN)) == 0)
      {
         transition = false;
      }
      return;
   }
   else
   {
      if (cruisestt & (CRUISE_SETP | CRUISE_SETN))
      {
         transition = true;
      }
   }

   //When pressing cruise control buttons and brake pedal
   //Use them to adjust regen level
   if (Param::GetBool(Param::din_brake))
   {
      int regenLevel = Param::GetInt(Param::regenlevel);
      if (cruisestt & CRUISE_SETP)
      {
         regenLevel++;
         regenLevel = MIN(3, regenLevel);
      }
      else if (cruisestt & CRUISE_SETN)
      {
         regenLevel--;
         regenLevel = MAX(0, regenLevel);
      }

      Param::SetInt(Param::regenlevel, regenLevel);
   }

   if (cruisestt & CRUISE_ON && Param::GetInt(Param::opmode) == MOD_DRIVE)
   {
      int currentSpeed = Param::GetInt(Param::speed);
      if (cruisespeed <= 0)
      {
         if (cruisestt & CRUISE_SETN && currentSpeed > 500) //Start cruise control at current speed
         {
            cruiseTarget = currentSpeed;
            cruisespeed = cruiseTarget;
         }
         else if (cruisestt & CRUISE_SETP && cruiseTarget > 0) //resume via ramp
         {
            cruisespeed = currentSpeed;
         }
      }
      else
      {
         if (cruisestt & CRUISE_DISABLE || Param::GetBool(Param::din_brake))
         {
            cruisespeed = 0;
         }
         else if (cruisestt & CRUISE_SETP)
         {
            cruiseTarget += Param::GetInt(Param::cruisestep);
         }
         else if (cruisestt & CRUISE_SETN)
         {
            if ((currentSpeed - cruisespeed) > 200) //When we have accelerated with throttle pedal reprogram cruise speed
            {
               cruiseTarget = currentSpeed;
               cruisespeed = cruiseTarget;
            }
            else
            {
               cruiseTarget -= Param::GetInt(Param::cruisestep);
            }
         }
      }
   }
   else
   {
      cruisespeed = 0;
      cruiseTarget = 0;
   }

   if (cruisespeed <= 0)
   {
      Param::SetInt(Param::cruisespeed, 0);
   }
   else if (cruisespeed < cruiseTarget)
   {
      Param::SetInt(Param::cruisespeed, RAMPUP(cruisespeed, cruiseTarget, Param::GetInt(Param::cruiserampup)));
   }
   else if (cruisespeed > cruiseTarget)
   {
      Param::SetInt(Param::cruisespeed, RAMPDOWN(cruisespeed, cruiseTarget, Param::GetInt(Param::cruiserampdn)));
   }
   else
   {
      Param::SetInt(Param::cruisespeed, cruisespeed);
   }
}

static void RunChaDeMo()
{
   int opmode = Param::GetInt(Param::opmode);

   if (opmode == MOD_QUICKSTART)
   {
      ChaDeMo::SetEnabled(true);
   }

   if (opmode == MOD_QUICKCHARGE)
   {
      int chargeCur = Param::GetInt(Param::chgcurlim);
      int chargeLim = Param::GetInt(Param::chargelimit);
      chargeCur = MIN(MIN(255, chargeLim), chargeCur);
      ChaDeMo::SetChargeCurrent(chargeCur);

      if (Param::GetBool(Param::cdmcheckena))
         ChaDeMo::CheckSensorDeviation(Param::GetInt(Param::udcbms));
   }

   if (opmode == MOD_CHARGEND)
   {
      ChaDeMo::SetEnabled(false);
      ChaDeMo::SetChargeCurrent(0);
   }

   ChaDeMo::SetTargetBatteryVoltage(Param::GetInt(Param::udclimit));
   ChaDeMo::SetBatteryVoltage(Param::GetInt(Param::udcbms));
   ChaDeMo::SetSoC(Param::Get(Param::soc));
   Param::SetInt(Param::cdmcureq, ChaDeMo::GetRampedCurrentRequest());

   if (opmode == MOD_QUICKCHARGE)
   {
      if (!mebBms->Alive(rtc_get_counter_val()))
         ChaDeMo::SetGeneralFault();

      Param::SetInt(Param::udccdm, ChaDeMo::GetChargerOutputVoltage());
      Param::SetInt(Param::idccdm, ChaDeMo::GetChargerOutputCurrent());
      ChaDeMo::SendMessages(can);
   }
   Param::SetInt(Param::cdmstatus, ChaDeMo::GetChargerStatus());

   if (opmode == MOD_QUICKCHARGE || opmode == MOD_QUICKSTART || opmode == MOD_CHARGEND)
      ChaDeMo::SendMessages(can);
}

static void SendVAG100msMessage()
{
   static int seqCtr = 0;
   static uint8_t ctr = 0;

   const uint8_t seq1[] = { 0x0f, 0x28, 0x7f, 0x28 };
   const uint8_t seq2[] = { 0x1e, 0x10, 0x00, 0x10 };
   const uint8_t seq3[] = { 0x70, 0x56, 0xf0, 0x56 };
   const uint8_t seq4[] = { 0x0c, 0x48, 0xa7, 0x48 };
   const uint8_t seq5[] = { 0x46, 0x90, 0x28, 0x90 };

   uint8_t canData[8] = { (uint8_t)(0x80 | ctr), 0, 0, seq1[seqCtr], seq2[seqCtr], seq3[seqCtr], seq4[seqCtr], seq5[seqCtr] };

   can->Send(0x580, (uint32_t*)canData);
   seqCtr = (seqCtr + 1) & 0x3;
   ctr = (ctr + 1) & 0xF;

   canData[1] = 48 + ((Param::GetFloat(Param::tmpm) * 4) / 3);
   canData[0] = canData[2] = canData[3] = canData[4] = canData[5] = canData[6] = canData[7] = 0;
   can->Send(0x288, (uint32_t*)canData);
}

static void SetFuelGauge()
{
   uint32_t rtc = rtc_get_counter_val();
   int dcoffset = Param::GetInt(Param::gaugeoffset);
   int tmpaux = Param::GetInt(Param::tmpaux);
   s32fp dcgain = Param::Get(Param::gaugegain);
   int soctest = Param::GetInt(Param::soctest);
   int soc = Param::GetInt(Param::energy) / 550; //percent of 55l petrol or in our case 55 kWh of energy
   soc = soctest != 0 ? soctest : soc;

   if (rtc < 300 && soc == 0) soc = 50; //before SoC is valid just display 50% to avoid a "refuel!" message with beep

   soc -= Param::GetInt(Param::gaugebalance);
   //Temperature compensation 1 digit per degree
   dcoffset -= tmpaux;
   int dc1 = FP_TOINT(dcgain * soc) + dcoffset;
   int dc2 = FP_TOINT(-dcgain * soc) + dcoffset;

   timer_set_oc_value(FUELGAUGE_TIMER, TIM_OC2, dc1);
   timer_set_oc_value(FUELGAUGE_TIMER, TIM_OC3, dc2);
}

static void CalcBatteryCurrentLimits()
{
   float cur = mebBms->GetMaximumChargeCurrent(Param::GetFloat(Param::cellmax));
   Param::SetFloat(Param::bmschglim, cur);

   if (Param::GetInt(Param::opmode) == MOD_CHARGE)
   {
      if (DigIo::dcsw_out.Get() && mebBms->Alive(rtc_get_counter_val()) && MOD_CHARGE == Param::GetInt(Param::opmode))
      {
         float chargeLimit = Param::GetFloat(Param::chargelimit);
         float obclimit = Param::GetFloat(Param::obclimit);

         cur = MIN(cur, chargeLimit);
         cur = MIN(cur, obclimit);
      }
      else
      {
         cur = 0;
      }
   }

