jsphuebner/stm32-car/src/stm32_car.cpp
   Param::SetFloat(Param::chgcurlim, cur);

   cur = mebBms->GetMaximumDischargeCurrent(Param::GetFloat(Param::cellmin));
   Param::SetFloat(Param::discurlim, cur);
}

static void SwitchDcDcConverterAndHeater()
{
   static int dcdcDelay = 10;
   bool heaterOnDrive = Param::Get(Param::tmpaux) < Param::Get(Param::heathresh);
   //Switch on heater when outside temperature is below threshold,
   //SoC is above threshold, heater command is on
   //OR heater command is "Force"
   //AND turn-on delay has expired
   heaterOnDrive &= Param::Get(Param::soc) > Param::Get(Param::heatsoc);
   heaterOnDrive &= Param::GetBool(Param::heatcmd);
   heaterOnDrive |= Param::GetInt(Param::heatcmd) == CMD_FORCE;
   heaterOnDrive &= dcdcDelay == 0;

   if (DigIo::dcsw_out.Get())
   {
      if (dcdcDelay > 0)
      {
         dcdcDelay--;
      }
      else
      {
         if (Param::GetFloat(Param::udcdc) < Param::GetFloat(Param::dcdcresume))
         {
            DigIo::dcdc_out.Set();
         }
         else if (Param::GetFloat(Param::udcdc) > 14.1f && Param::GetFloat(Param::idcdc) < Param::GetFloat(Param::dcdcutoff))
         {
            DigIo::dcdc_out.Clear();
         }
      }
   }
   else
   {
      dcdcDelay = 10;
      DigIo::dcdc_out.Clear();
   }

   switch (Param::GetInt(Param::opmode))
   {
   case MOD_DRIVE:
      if (heaterOnDrive)
         DigIo::heater_out.Set();
      else
         DigIo::heater_out.Clear();
      break;
   case MOD_CHARGE:
      if (Param::GetBool(Param::heatcmd) && dcdcDelay == 0)
         DigIo::heater_out.Set();
      else
         DigIo::heater_out.Clear();
      break;
   case MOD_QUICKSTART:
   case MOD_QUICKCHARGE:
      if (Param::GetBool(Param::heatcmd) && DigIo::dcsw_out.Get() && dcdcDelay == 0)
         DigIo::heater_out.Set();
      else
         DigIo::heater_out.Clear();
      break;
   default:
      DigIo::heater_out.Clear();
      break;
   }
}

/* Control vacuum pump. It only runs in drive mode
* Pin level is inverted, so Set() turns off */
static void SwitchVacuumPump()
{
   int vacuumthresh = Param::GetInt(Param::vacuumthresh);
   int vacuumhyst = Param::GetInt(Param::vacuumhyst);
   int vacuum = AnaIn::vacuum.Get();

   Param::SetInt(Param::vacuum, vacuum);

   switch (Param::GetInt(Param::opmode))
   {
   case MOD_DRIVE:
      if (vacuum > vacuumthresh && DigIo::dcdc_out.Get())
      {
         DigIo::vacuum_out.Clear(); //Turn on pump only when DC/DC converter is running
      }
      else if (vacuum < vacuumhyst)
      {
         DigIo::vacuum_out.Set();
      }
      break;
   default:
      DigIo::vacuum_out.Set();
      break;
   }
}

static void SwitchEvse()
{
   switch (Param::GetInt(Param::opmode))
   {
   case MOD_CHARGE:
      Param::SetInt(Param::dout_evse, 1);
      break;
   default:
      Param::SetInt(Param::dout_evse, 0);
      break;
   }
}

static void CalculateSoc()
{
   static float estimatedSoc = 0;
   static uint32_t lastCurrentTime = 0;
   static int32_t asOffset = 0;
   uint32_t rtc = rtc_get_counter_val();
   float current = isa->GetValue(IsaShunt::CURRENT) / 1000.0f;

   if (ABS(current) > 1)
      lastCurrentTime = rtc;

   if (rtc > 250)
      mebBms->Accumulate();

   if (rtc < 100) //startup
   {
      estimatedSoc = FP_TOFLOAT(BKP_DR1);
      asOffset = isa->GetValue(IsaShunt::AS);
      Param::SetFixed(Param::soh, BKP_DR2); //try loading SoH
   }
   else if ((rtc - lastCurrentTime) > 12000 || (estimatedSoc == 0 && rtc > 250)) //no current flow since 120s or failed to load previous SOC
   {
      int32_t as = isa->GetValue(IsaShunt::AS);
      int32_t asChange = ABS(as - asOffset);

      if (asChange > 36000) //more than 10Ah difference
      {
         float estimatedAs = mebBms->EstimateSocFromVoltage() - estimatedSoc; //Calculate difference in percent to last estimation
         estimatedAs = ABS(estimatedAs); //only the absolute value is of interest
         estimatedAs*= mebBms->GetMaximumAmpHours(); //multiply with supposedly available amp hours
         estimatedAs*= 3600.0f / 100; //multiply by 3600 (Ah to As) and divide by 100 because percent
         float soh = asChange / estimatedAs;
         soh *= 100;
         Param::SetFloat(Param::soh, soh);
         BKP_DR2 = FP_FROMFLT(soh);
      }
      estimatedSoc = mebBms->EstimateSocFromVoltage();
      Param::SetFloat(Param::soc, estimatedSoc);
      asOffset = as;
      Param::SetFloat(Param::energy, mebBms->GetRemainingEnergy(estimatedSoc));
      BKP_DR1 = FP_FROMFLT(estimatedSoc);
   }
   else
   {
      int32_t as = isa->GetValue(IsaShunt::AS) - asOffset;
      float ah = as / 3600.0f;
      float socChange = 100 * ah / mebBms->GetMaximumAmpHours();
      float soc = estimatedSoc + socChange;
      Param::SetFloat(Param::ahdiff, ah);
      Param::SetFloat(Param::soc, soc);
      Param::SetFloat(Param::energy, mebBms->GetRemainingEnergy(soc));
      BKP_DR1 = FP_FROMFLT(soc);
   }
}

static void SendMitsubishiMessages()
{
   int opmode = Param::GetInt(Param::opmode);

   if (opmode == MOD_CHARGE || opmode == MOD_CHARGESTART || opmode == MOD_CHARGEND)
   {
      uint32_t data[2];

      data[0] = (Param::GetBool(Param::dout_evse) * 182) << 16;
      data[1] = 0;

      can->Send(645, data);

      data[0] = Param::GetInt(Param::udcbms) + (((int)(Param::GetFloat(Param::chgcurlim) * 10)) << 16);

      can->Send(646, data);
   }
}

static void DetectReverse()
{
   static float ratio = 0, lockout = 0;
   float wheelspeed = (Param::GetFloat(Param::wheelfr) + Param::GetFloat(Param::wheelfl)) / 2;
   int motorspeed = Param::GetFloat(Param::speed);
   if (ratio == 0) ratio = Param::GetFloat(Param::limratiothr) * 0.9f;

   if (lockout > 0) lockout--;
   if (wheelspeed > 1 && motorspeed > 100 && lockout == 0)
   {
      ratio = IIRFILTERF(ratio, motorspeed / wheelspeed, 1);
      Param::SetFloat(Param::ratio, ratio);
      bool derate = ratio > Param::GetFloat(Param::limratiothr);
      Param::SetInt(Param::din_bms, derate);
      if (derate) lockout = 10;
   }
}

static void Ms100Task()
{
   static int balanceCell = 0;
   uint32_t rtc = rtc_get_counter_val();

   DigIo::led_out.Toggle();
   iwdg_reset();
   float cpuLoad = scheduler->GetCpuLoad();
   float current = isa->GetValue(IsaShunt::CURRENT) / 1000.0f;
   //float cpVtg = (isa->GetValue(IsaShunt::U1) - isa->GetValue(IsaShunt::U2)) / 1000.0f;
   Param::SetFloat(Param::cpuload, cpuLoad / 10);
   Param::SetInt(Param::lasterr, ErrorMessage::GetLastError());
   mebBms->Balance(Param::GetBool(Param::balance), balanceCell);

   Param::SetFloat(Param::tmpbat1, mebBms->GetModuleTemperature(0));
   Param::SetFloat(Param::tmpbat2, mebBms->GetModuleTemperature(1));
   Param::SetFloat(Param::tmpbat3, mebBms->GetModuleTemperature(2));
   Param::SetFloat(Param::tmpbat4, mebBms->GetModuleTemperature(3));
   Param::SetFloat(Param::tmpbat5, mebBms->GetModuleTemperature(4));
   Param::SetFloat(Param::tmpbat6, mebBms->GetModuleTemperature(5));
   Param::SetFloat(Param::tmpbat7, mebBms->GetModuleTemperature(6));
   Param::SetFloat(Param::tmpbat8, mebBms->GetModuleTemperature(7));
   Param::SetFloat(Param::batmin, mebBms->GetMinCellVoltage());
   Param::SetFloat(Param::batmax, mebBms->GetMaxCellVoltage());
   Param::SetFloat(Param::batavg, mebBms->GetAvgCellVoltage());
   Param::SetFloat(Param::udcbms, mebBms->GetTotalVoltage());
   Param::SetFloat(Param::idc, current);
   //Param::SetFloat(Param::udccdm, cpVtg);

   isa->InitializeAndStartIfNeeded();

   CalculateSoc();
   CalcBatteryCurrentLimits();
   ProcessCruiseControlButtons();
   RunChaDeMo();
   SendMitsubishiMessages();
   SwitchVacuumPump();
   SwitchDcDcConverterAndHeater();
   SwitchEvse();
   SendVAG100msMessage();
   SetFuelGauge();
   DetectReverse();

   if (!mebBms->Alive(rtc))
   {
      ErrorMessage::Post(ERR_BMSCOMM);
   }

   int invErr = Param::GetInt(Param::inverr);
   if (Param::GetBool(Param::din_charge))
   {
      Param::SetInt(Param::errlights, 4); //EPC light
   }
   else if (invErr > 0 || ErrorMessage::GetLastError() > 0)
   {
      if (invErr == 2 || invErr == 3) //throttle errors
         Param::SetInt(Param::errlights, 4); //EPC light
      else //all other errors
         Param::SetInt(Param::errlights, 8); //Engine error light
   }
   else
   {
      Param::SetInt(Param::errlights, 0);
   }

   Param::SetInt(Param::canrec, CAN_ESR(CAN1) >> 24);
   Param::SetInt(Param::cantec, (CAN_ESR(CAN1) >> 16) & 0xff);
   Param::SetInt(Param::canlec, (CAN_ESR(CAN1) >> 4) & 0x7);
   Param::SetInt(Param::canerr, CAN_ESR(CAN1) & 0x7);
   Param::SetInt(Param::uptime, rtc / 100);
}

static void GetDigInputs()
{
   static int chargeInCount = 0;
   static bool chargeIn = false;
   int canio = 0;

   /* charge_in only reads high when the VCU isn't started up in charge mode with the car off
    * not sure why. So when it is high we know for sure that PP is plugged in somewhere
    * but when it is low it doesn't mean that nothing is plugged in
    * It does go high when turning the car on into a charge session, so can be used as
    * drive off protection */

   /* I think I forgot fitting the low pass filter cap. So we filter a bit here */
   if (DigIo::charge_in.Get() && chargeInCount < 10)
      chargeInCount++;
   else if (!DigIo::charge_in.Get() && chargeInCount > 0)
      chargeInCount--;

   if (chargeInCount == 10)
      chargeIn = true;
   else if (chargeInCount == 0)
      chargeIn = false;

   Param::SetInt(Param::din_charge, chargeIn);

   if (Param::GetInt(Param::cruisestt) & CRUISE_ON)
      canio |= CAN_IO_CRUISE;
   if (Param::GetBool(Param::din_start) || DigIo::start_in.Get())
      canio |= CAN_IO_START;
   if (Param::GetBool(Param::din_brake))
      canio |= CAN_IO_BRAKE;
   if (Param::GetBool(Param::din_forward))
      canio |= CAN_IO_FWD;
   if (Param::GetBool(Param::din_reverse))
      canio |= CAN_IO_REV;
   if (Param::GetBool(Param::din_bms))
      canio |= CAN_IO_BMS;

