jsphuebner/stm32-car/src/stm32_car.cpp
   Param::SetInt(Param::canio, canio);
}

static void TractionControl(float& throtmin, float& throtmax)
{
   if (!Param::GetBool(Param::espoff))
   {
      float frontAxleSpeed = (Param::GetFloat(Param::wheelfl) + Param::GetFloat(Param::wheelfr)) / 2;
      float rearAxleSpeed = (Param::GetFloat(Param::wheelrl) + Param::GetFloat(Param::wheelrr)) / 2;
      float diff = frontAxleSpeed - rearAxleSpeed;
      float kp = Param::GetFloat(Param::tractionkp);

      //Here we assume front wheel drive
      if (diff < 0)
      {
         //Front axle turns slower than rear axle -> too much breaking force
         float speedErr = Param::GetFloat(Param::allowedlag) - diff;
         throtmin = -100 + (kp * speedErr);
      }
      else
      {
         //Front axle turns faster than rear axle -> wheel spin
         float speedErr = Param::GetFloat(Param::allowedspin) - diff;
         throtmax = 100 + (kp * speedErr);
      }
   }
}

static void ProcessThrottle()
{
   int pot1 = AnaIn::throttle1.Get();
   int pot2 = AnaIn::throttle2.Get();
   int brakePressure = Param::GetInt(Param::brakepressure);
   int offPedalRegen = Param::GetInt(Param::regenlevel) * 24;

   brakePressure = MAX(offPedalRegen, brakePressure);
   brakePressure = MIN(100, brakePressure);

   Param::SetInt(Param::pot, pot1);
   Param::SetInt(Param::pot2, pot2);
   Param::SetInt(Param::potbrake, brakePressure);
}

static void LimitThrottle()
{
   float throtmin = -100, throtmax = 100;

   TractionControl(throtmin, throtmax);

   throtmin = MIN(0, throtmin);
   throtmin = MAX(-100, throtmin);
   throtmax = MIN(100, throtmax);
   throtmax = MAX(0, throtmax);

   Param::SetFloat(Param::calcthrotmax, throtmax);
   Param::SetFloat(Param::calcthrotmin, throtmin);
}

static void SendOIControlMessage()
{
   uint32_t data[2];
   uint32_t pot = Param::GetInt(Param::pot) & 0xFFF;
   uint32_t pot2 = Param::GetInt(Param::pot2) & 0xFFF;
   uint32_t canio = Param::GetInt(Param::canio) & 0x3F;
   uint32_t ctr = Param::GetInt(Param::canctr) & 0x3;
   uint32_t cruise = Param::GetInt(Param::cruisespeed) & 0x3FFF;
   uint32_t regen = Param::GetInt(Param::potbrake) & 0x7F;

   data[0] = pot | (pot2 << 12) | (canio << 24) | (ctr << 30);
   data[1] = cruise | (ctr << 14) | (regen << 16);

   crc_reset();
   uint32_t crc = crc_calculate_block(data, 2) & 0xFF;
   data[1] |= crc << 24;

   can->Send(63, data);
}

static void SendVag10MsMessages(float power)
{
   const uint8_t seq2[] = { 0x10, 0x68, 0x94, 0xC0 };
   static int seq1Ctr = 0;
   static uint16_t consumptionCounter = 0;
   static uint32_t accumulatedRegen = 0;
   uint32_t canData[2];
   int32_t consumptionIncrement = -2.8f * power;
   int cruiselight = Param::GetInt(Param::cruiselight);
   int errlights = Param::GetInt(Param::errlights);

   seq1Ctr = (seq1Ctr + 1) & 0x3;

   //Obviously the petrol consumption counter cannot handle
   //negative values. So we accumulate regen energy and
   //subtract it from the consumption once we're out of regen
   if (consumptionIncrement >= 0)
   {
      if (accumulatedRegen > (uint32_t)consumptionIncrement)
      {
         accumulatedRegen -= consumptionIncrement;
         consumptionIncrement = 0;
      }
      else if (accumulatedRegen > 0) //greater 0 but less than current draw
      {
         consumptionIncrement -= accumulatedRegen;
         accumulatedRegen = 0;
      }
      consumptionCounter += consumptionIncrement;
   }
   //Only accumulate regen, not charging current!
   else if (Param::GetInt(Param::opmode) == MOD_DRIVE)
   {
      accumulatedRegen += -consumptionIncrement;
   }

   //Byte1 seq 2, Byte ?, Byte 7 XOR(bytes[0..6])
   uint8_t check = seq2[seq1Ctr] ^ errlights ^ (consumptionCounter & 0xFF) ^ (consumptionCounter >> 8) ^ cruiselight ^ 0x1A;
   canData[0] = seq2[seq1Ctr] | errlights << 8 | consumptionCounter << 16;
   canData[1] = 0x1A | cruiselight << 18 | check << 24;

   can->Send(0x480, canData);
}

static void SwitchPositiveContactor()
{
   int udcbms = Param::GetInt(Param::udcbms);
   int udcobc = Param::GetInt(Param::udcobc);
   bool prechargeComplete = udcbms > 250 && (udcbms - udcobc) < 10;
   bool noContactorPower = false;

   if (ignitionTimeout > 0)
   {
      ignitionTimeout--;
   }
   //Car has been turned off as in we no longer receive certain CAN messages
   //With the car off the contactors will loose power
   //So we need to release the turn on signal as well
   //otherwise when the ignition is turned back on
   //the positive contactor will close without precharging
   //Only do this when we are really sure we're not driving
   else if (Param::GetInt(Param::speed) == 0)
   {
      noContactorPower = true;
      Param::SetInt(Param::udcobc, 0); //delete stale value
   }

   switch (Param::GetInt(Param::opmode))
   {
   case MOD_OFF:
      if (prechargeComplete && !noContactorPower)
         DigIo::dcsw_out.Set();
      break;
   case MOD_CHARGE:
   case MOD_DRIVE:
      DigIo::dcsw_out.Set();
      break;
   case MOD_QUICKSTART:
   case MOD_QUICKCHARGE:
      if (noContactorPower)
         DigIo::dcsw_out.Clear();
      else if (prechargeComplete)
         DigIo::dcsw_out.Set();
      break;
   default:
      break;
   }
}

static void SetRevCounter()
{
   float power = Param::GetFloat(Param::power);
   power = MAX(0, power); //no negative values

   switch (Param::GetInt(Param::opmode))
   {
   case MOD_DRIVE:
      Param::SetInt(Param::speedmod, MAX(700, Param::GetInt(Param::speed)));
      Param::SetInt(Param::din_forward, 1);
      DigIo::oil_out.Set(); //Simulate valid oil pressure
      break;
   case MOD_QUICKCHARGE:
      Param::SetInt(Param::speedmod, power * 100);
      Param::SetInt(Param::din_forward, 0);
      //Simulate oil pressure switch, on above 900 rpm = 9 kW, off below 500 rpm = 5 kw
      if (power > 9)
         DigIo::oil_out.Set();
      else if (power < 5)
         DigIo::oil_out.Clear();
      break;
   default:
      Param::SetInt(Param::speedmod, 0);
      Param::SetInt(Param::din_forward, 0);
      DigIo::oil_out.Clear(); //Simulate no oil pressure
      break;
   }
}

static void Ms10Task(void)
{
   float idc = Param::GetFloat(Param::idc);
   float udcbms = Param::GetFloat(Param::udcbms);
   float power = (idc * udcbms) / 1000;

   Param::SetFloat(Param::power, power);

   GetDigInputs();
   Param::SetInt(Param::opmode, StateMachine((modes)Param::GetInt(Param::opmode)));
   ProcessThrottle();
   LimitThrottle();
   SwitchPositiveContactor();
   SetRevCounter();

   ErrorMessage::SetTime(rtc_get_counter_val());
   Param::SetInt(Param::dout_dcsw, DigIo::dcsw_out.Get());
   Param::SetInt(Param::dout_dcdc, DigIo::dcdc_out.Get());

   SendVag10MsMessages(power);
   Param::SetInt(Param::canctr, (Param::GetInt(Param::canctr) + 1) & 0xF);
   SendOIControlMessage();
   canMap->SendAll();
}

