jsphuebner/stm32-car/src/stm32_car.cpp
static void DecodeCruiseControl(uint32_t data)
{
   int ctr1 = (data >> 4) & 0xF;
   int ctr2 = (data >> 20) & 0xF;
   int stt1 = (data >> 8) & 0xF;
   int stt2 = (data >> 0) & 0xF;

   if (ctr1 == ctr2)
   {
      int decodedStt = 0;
      if (stt2 == 13) decodedStt = CRUISE_ON;
      if (stt2 == 15) decodedStt = CRUISE_ON | CRUISE_DISABLE;
      if (stt2 == 9) decodedStt = CRUISE_ON | CRUISE_SETN;
      if (stt2 == 5) decodedStt = CRUISE_ON | CRUISE_SETP;

      if (decodedStt == stt1)
      {
         Param::SetInt(Param::cruisestt, stt1);
      }
   }
}

/** This function is called when the user changes a parameter */
extern void Param::Change(Param::PARAM_NUM paramNum)
{
   switch (paramNum)
   {
   case Param::ahmax:
      mebBms->SetMaximumAmpHours(Param::GetFloat(Param::ahmax));
      break;
   case Param::chargekp:
   case Param::chargeki:
      mebBms->SetControllerGains(Param::GetInt(Param::chargekp), Param::GetInt(Param::chargeki));
      break;
   default:
      break;
   }
}

static bool CanCallback(uint32_t id, uint32_t data[2], uint8_t dlc)
{
   int tmpdcdc[3];
   switch (id)
   {
   case 0x108:
      ChaDeMo::Process108Message(data);
      chargerTimeout = 50;
      break;
   case 0x109:
      ChaDeMo::Process109Message(data);
      break;
   case 0x420:
      Param::SetFloat(Param::tmpaux, ((((data[0] >> 8) & 0xFF) - 100.0f)) / 2);
      ignitionTimeout = 50;
      break;
   case 0x377:
      Param::SetFloat(Param::udcdc, (((data[0] & 0xFF) << 8) + ((data[0] & 0xFF00) >> 8)) * 0.01f);
      Param::SetFloat(Param::idcdc, (((data[0] & 0xFF0000) >> 8) + ((data[0] & 0xFF000000) >> 24)) * 0.1f);
      tmpdcdc[0] = data[1] & 0xFF;
      tmpdcdc[1] = (data[1] >> 8) & 0xFF;
      tmpdcdc[2] = (data[1] >> 16) & 0xFF;
      Param::SetFloat(Param::tmpdcdc, MAX(MAX(tmpdcdc[0], tmpdcdc[1]), tmpdcdc[2]) - 40);
      ignitionTimeout = 50;
      break;
   case 0x38A:
      if (4 == dlc)
         DecodeCruiseControl(data[0]);
      break;
   default:
      break;
   }
   return false;
}

static void HandleClear()
{
   can->RegisterUserMessage(0x108);
   can->RegisterUserMessage(0x109);
   can->RegisterUserMessage(0x420);
   can->RegisterUserMessage(0x377);
   can->RegisterUserMessage(0x38A);
}

extern "C" void tim2_isr(void)
{
   scheduler->Run();
}

extern "C" int main(void)
{
   extern const TERM_CMD termCmds[];

   clock_setup();
   rtc_setup();
   write_bootloader_pininit();
   ANA_IN_CONFIGURE(ANA_IN_LIST);
   DIG_IO_CONFIGURE(DIG_IO_LIST);
   AnaIn::Start();
   tim_setup();
   nvic_setup();
   parm_load();

   Stm32Can c(CAN1, CanHardware::Baud500);
   FunctionPointerCallback cb(CanCallback, HandleClear);

   can = &c;
   IsaShunt i(&c, IsaShunt::CURRENT | IsaShunt::AS);
   c.AddCallback(&cb);
   CanMap cm(&c);
   CanSdo sdo(&c, &cm);
   MebBms mb(&c);
   TerminalCommands::SetCanMap(&cm);
   SdoCommands::SetCanMap(&cm);
   HandleClear();
   sdo.SetNodeId(2);

   canMap = &cm;
   mebBms = &mb;
   isa = &i;
   mebBms->SetMaximumAmpHours(Param::GetFloat(Param::ahmax));
   mebBms->SetControllerGains(Param::GetInt(Param::chargekp), Param::GetInt(Param::chargeki));

   Stm32Scheduler s(TIM2); //We never exit main so it's ok to put it on stack
   scheduler = &s;

   #if TARGET == 107
   Terminal t(USART3, termCmds, true);
   #else
   Terminal t(USART3, termCmds);
   #endif

   s.AddTask(Ms10Task, 10);
   s.AddTask(Ms100Task, 100);
   s.AddTask(Ms500Task, 500);

   Param::SetInt(Param::version, 4); //COM protocol version 4
   Param::SetInt(Param::rstreason, RCC_CSR >> 26);
   RCC_CSR |= RCC_CSR_RMVF;

   while(1)
   {
      char dummy = 0;
      CanSdo::SdoFrame* sdoFrame = sdo.GetPendingUserspaceSdo();
      t.Run();

      if (sdo.GetPrintRequest() == PRINT_JSON)
      {
         TerminalCommands::PrintParamsJson(&sdo, &dummy);
      }

      if (0 != sdoFrame)
      {
         SdoCommands::ProcessStandardCommands(sdoFrame);
         sdo.SendSdoReply(sdoFrame);
      }
   }

   return 0;
}

